[
    {
        "title": "The Fenty Effect: Data-Driven Evidence of Inclusivity Shifts in Cosmetic Shade Ranges",
        "year": "2025",
        "image": "../images/fenty.png",
        "description": "For this project, my team conducted an exploratory data analysis investigating how U.S. beauty brands' foundation shade ranges changed following the rise of inclusivity-first brands like Fenty Beauty in 2017. We cleaned and merged shade-level data for 6,800+ products, quantified brightness distributions from hex color codes, and analyzed trends in shade count and variance over time to evaluate whether the “Fenty Effect” corresponded with broader industry diversification. Our next step is to extend this work with formal hypothesis testing to assess the statistical significance of these patterns."
    },
    {
        "title": "Build a Hit",
        "year": "2025",
        "image": "../images/build_a_hit.png",
        "description": "In this group project, I helped build an interactive web tool that lets users “build” a song by adjusting musical features like tempo, energy, and danceability. We trained a logistic regression model on a large Spotify dataset to predict how likely the custom song is to become a hit and to identify the three most similar tracks. The site also generates interactive histograms that compare the user's song features against both hit and non-hit songs in the dataset."
    },
    {
        "title": "Boston Bike Traffic Map",
        "year": "2025",
        "image": "../images/bos_bike_traffic.png",
        "description": "In this project, I built an interactive geospatial visualization that maps traffic sensor data across San Diego. I integrated D3.js with real-world coordinate projections to render a dynamic map where users can explore traffic patterns over time using a custom time slider. The project involved data cleaning, temporal filtering, and designing clear visual encodings to highlight changes in urban movement."
    },
    {
        "title": "How Will My Climate Change?",
        "year": "2025",
        "image": "../images/clim_change.png",
        "description": "In this project, my group built an interactive climate visualization tool using CMIP6 historical and projected data to show how temperature and precipitation anomalies vary across the United States. The interface combines a choropleth map, time slider, variable selector, and regional brushing to help users explore spatial and temporal trends. A linked line chart reveals long-term patterns for both the U.S. average and any user-selected region. The project emphasizes accessibility, clean design, and meaningful interpretation of climate data."
    },
    {
        "title": "Deceptive Visualizations",
        "year": "2025",
        "image": "../images/Screenshot 2025-10-24 215056.png",
        "description": "Our group generated one data visualization supporting the proposition that black police officers are more likely to face severe discipline for substantiated complaints than officers of color, even when accounting for complaint type, and one arguing against it. These visualizations incorporated deceptive visualization techniques that convinced viewers of their respective messages."
    },
    {
        "title": "The Cost of Convenience: How Industrial Processing Strips Food of Nutrition",
        "year": "2025",
        "image": "../images/Screenshot 2025-10-24 215605.png",
        "description": "Average nutrient profiles per 100g of food (scaled 0-1 for visual clarity) across NOVA processing levels."

    },
    {
        "title": "Recipe Ratings and Health: Does Nutrition Affect How We Rate?",
        "year": "2025",
        "image": "../images/Screenshot 2025-10-24 215827.png",
        "description": "We all have different ideas about what makes a recipe great—taste, convenience, healthiness, or a mix of all three. But when people leave reviews online, what factors most influence those ratings? For my DSC 80 final project at UC San Diego, I explored whether the nutritional content of a recipe, like its protein, sugar, or calories, influences how well it’s rated by users. I used two datasets from Food.com containing thousands of recipes and user ratings."
    },
    {
        "title": "Language Modeling from Scratch: Building N-Gram Text Generators",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I implemented and compared Uniform, Unigram, and N-Gram language models from scratch to generate text and estimate word sequence probabilities using data from Project Gutenberg."
    },
    {
        "title": "Loan Data Analysis and Tax-Adjusted Income Modeling",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I cleaned and analyzed U.S. loan data to explore relationships between credit scores, loan terms, and income after taxes. I also performed permutation testing and identified an example of Simpson’s Paradox in borrower behavior."
    },
    {
        "title": "San Diego Bus Network Simulation and Visualization",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I modeled, analyzesd, and visualized San Diego's public bus network, integrating geospatial data, graph traversal, and stochastic simulation to explore transit connectivity and passenger experiences."
    },
    
    {
        "title": "Data Analysis Proposal: Country GDP, Plastic Waste Production, and Recycling Rates",
        "year": "2024",
        "image": "../images/inbox_7974466_2e35db3d00a1499fc3ab586829a80eb9_AlbedoBase_XL_Create_a_powerful_environmental_data_visualizati_0.jpg",
        "description": "Our group developed a structured proposal for a data analysis project analyzing the relationship between country GDP, resource consumption, plastic waste production, and recycling rates. We also designed a methodology for data collection, wrangling, visualization, and analysis, including merging real datasets found from Kaggle."
    },
    {
        "title": "Image Classification with K-Nearest Neighbors",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "I implemented an image classification system from scratch using the K-Nearest Neighbors algorithm. I wrote functions to process RGB images, compute pixel-level distances, and predict labels based on nearest neighbors. I optimized my implementation for clarity and efficiency while ensuring accurate classification results across test images."
    },
    {
        "title": "Exploring Meteorite Landings with NASA Data",
        "year": "2023",
        "image": "../images/output.png",
        "description": "This project explores NASA's Meteorite Landings dataset to uncover patterns in meteorite discoveries around the world. Using Python (Pandas, NumPy, and visualization libraries), I cleaned and analyzed over 45,000 recorded landings to identify trends in geographic distribution, classification types, and changes over time. I also examined data accuracy by comparing “seen” vs. “recorded” events and visualized global meteorite impact sites."
    }
    
]